SHARED_DEPARTMENTS = {
    'дільниці з ремонту та благоустрою': 'ДРіБ',
    'ЦДС': 'ЦДС',
}

REGIONAL_DEPARTMENTS = {
    'Покровського цеху': 'Покровський',
    'Північного цеху': 'Північний',
    'Металургійного цеху': 'Металургійний',
    'Саксаганського цеху': 'Саксаганський',
    'Інгулецького цеху': 'Інгулецький',
    'Довгинцівського цеху': 'Довгинцівський',
    'Центрально-Міського цеху': 'Центр-Міськ',
}

JOB_SECTIONS = {
    'водопровідні мережі': 'Водопровід',
    'мережі водовідведення': 'Водовідведення',
    'мереж водовідведення': 'Водовідведення',
    'відведення шахтних вод': 'Шахтні води',
    'мережі шахтних вод': 'Шахтні води',
}

SECTION_NUMBERS = {
    'Водопровід': 1,
    'Водовідведення': 2,
    'Шахтні води': 3,
}

SECTION_TEMPLATE = 'Р.{number}. {name}:'
TYPE_TEMPLATE = 'Р.{number}.1. {name}:'

CONTRACT_START_TRIGGER = 'КП "Кривбасводоканал"'

RESULT_FILE_NAME = 'рeєcтр за {month}{number}.{format}'

MISSING_FOLDER = 'Не знайдено папку "{folder}".'

MONTH_PROMPT = \
    'Уважно введіть назву місяця, щодо якого необхідно створити рeєcтр:\n'

REGISTRY_HEADER = [
    'РЕЄСТР',
    'виконанних ремонтних робіт господарським способом',
    'підрозділами КП"Кривбасводоканал"',
    'мережі',
]

MONTH_HEADER = 'за {month} 2021р.'

TABLE_START_ROW = 8

TABLE_HEADERS = [
    '№ п/п',
    'Інв. №',
    'Адреса',
    'Найменування робіт',
    'Ф труб, мм',
    'Сума по акту',
    'Матеріали',
    'Зар.плата осн. робоч. з урах. мезаниз.',
    'Вид матеріалу',
    'Довжина, п.м',
    'Вартість матеріалів',
    'Зар. плата машиністів',
    'Виконавець',
    'Від. зат',
    'Довжина',
    'Прим.',
]

ADDRESS_COLUMN = 'C'
COST_COLUMN = 'K'
LAST_TABLE_COLUMN = 'P'

DATA_START_ROW = 10

TABLE_TOTALS = [
    '',
    '',
    'Разом:',
    '',
    '',
    '=SUM(E{start}:F{table_size})',
    '=SUM(F{start}:G{table_size})',
    '=SUM(G{start}:H{table_size})',
    '',
    '=SUM(I{start}:J{table_size})',
    '=SUM(J{start}:K{table_size})',
    '=SUM(K{start}:L{table_size})',
    '',
    '',
    '=SUM(N{start}:O{table_size})',
    '',
]

TABLE_FOOTER = [
    ['Склав:'],
    ['Інженер відділу', '', '', '', '', '', '', 'Г.Г. Ганжа']
]

WAIT_MESSAGE = 'Програма обробляє дані з таблиць, зачекайте...'

FINISH_PROMPT = \
    'Програма закінчила своє виконання. Натисніть Enter або закрийте вікно.'

ERROR_MESSAGE = (
    'Відбулась помилка під час обробки файлу {filepath} у рядку {row}. '
    'Дані з цього файлу будуть проігноровані.'
)

CONTRACT_NUMBER_SIGNIFIER = 'інв.№ '

SHEET_NAME = 'Реєстр'

HEADER_TO_MERGE = [
    f'A1:{LAST_TABLE_COLUMN}1',
    f'A2:{LAST_TABLE_COLUMN}2',
    f'A3:{LAST_TABLE_COLUMN}3',
    f'A4:{LAST_TABLE_COLUMN}4',
    f'A5:{LAST_TABLE_COLUMN}5',
]

FOOTER_TO_MERGE = [
    'A{row}:B{row}',
    'A{row}:D{row}',
]

COLUMN_WIDTHS = [
    27,
    45,
    135,
    155,
    48,
    105,
    93,
    138,
    65,
    58,
    68,
    75,
    79,
    34,
    60,
    43,
]

HIDDEN_COLUMNS = {
    5, 6, 7, 11, 13, 14
}
